---
title: 'Chapter 7 : Data Cleaning and Preparation'
author: Karim
editor: visual
---

In [1]:
import pandas as pd
import numpy as np

# 7.1: Handling Missing Data

In [2]:
float_data=pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data=pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data=pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna

<bound method Series.isna of 0    1.0
1    2.0
2    NaN
dtype: float64>

## Filtering Out Missing Data

In [8]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data.notna()
data[data.notna()]

0     True
1    False
2     True
3    False
4     True
dtype: bool

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data=pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df=pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0  0.454832 -0.443586 -2.518383
1 -0.282606 -0.287081 -1.256941
2  1.090584  1.507521 -1.630230
3  0.330442  0.896603  0.520128
4 -0.828920  2.362258  1.809910
5  0.968108 -0.857953 -0.796413
6 -0.388172 -0.765950  0.908811

In [16]:
df.iloc[:4,1]=np.nan
df

          0         1         2
0  0.454832       NaN -2.518383
1 -0.282606       NaN -1.256941
2  1.090584       NaN -1.630230
3  0.330442       NaN  0.520128
4 -0.828920  2.362258  1.809910
5  0.968108 -0.857953 -0.796413
6 -0.388172 -0.765950  0.908811

In [17]:
df.iloc[:2,2]=np.nan
df

          0         1         2
0  0.454832       NaN       NaN
1 -0.282606       NaN       NaN
2  1.090584       NaN -1.630230
3  0.330442       NaN  0.520128
4 -0.828920  2.362258  1.809910
5  0.968108 -0.857953 -0.796413
6 -0.388172 -0.765950  0.908811

In [18]:
df.dropna(thresh=2)

          0         1         2
2  1.090584       NaN -1.630230
3  0.330442       NaN  0.520128
4 -0.828920  2.362258  1.809910
5  0.968108 -0.857953 -0.796413
6 -0.388172 -0.765950  0.908811

## Filling In Missing Data

In [19]:
df.fillna(0)

          0         1         2
0  0.454832  0.000000  0.000000
1 -0.282606  0.000000  0.000000
2  1.090584  0.000000 -1.630230
3  0.330442  0.000000  0.520128
4 -0.828920  2.362258  1.809910
5  0.968108 -0.857953 -0.796413
6 -0.388172 -0.765950  0.908811

In [20]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.454832  0.500000  0.000000
1 -0.282606  0.500000  0.000000
2  1.090584  0.500000 -1.630230
3  0.330442  0.500000  0.520128
4 -0.828920  2.362258  1.809910
5  0.968108 -0.857953 -0.796413
6 -0.388172 -0.765950  0.908811

In [21]:
df=pd.DataFrame(np.random.standard_normal((6,3)))
df.iloc[2:,1]=np.nan
df.iloc[4:,2]=np.nan
df

          0         1         2
0  0.429218 -0.000852 -0.312988
1 -0.893763  0.079865  0.981738
2  1.029833       NaN  0.702081
3 -1.167652       NaN  0.480413
4 -0.637523       NaN       NaN
5 -0.521986       NaN       NaN

In [22]:
df.fillna(method="ffill")

          0         1         2
0  0.429218 -0.000852 -0.312988
1 -0.893763  0.079865  0.981738
2  1.029833  0.079865  0.702081
3 -1.167652  0.079865  0.480413
4 -0.637523  0.079865  0.480413
5 -0.521986  0.079865  0.480413

In [23]:
df.fillna(method="ffill",limit=2)

          0         1         2
0  0.429218 -0.000852 -0.312988
1 -0.893763  0.079865  0.981738
2  1.029833  0.079865  0.702081
3 -1.167652  0.079865  0.480413
4 -0.637523       NaN  0.480413
5 -0.521986       NaN  0.480413

In [24]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2: Data Transformation

## Removing Duplicates

In [25]:
data=pd.DataFrame({"k1":["one","two"]*3+["two"],"k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data["v1"]=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [30]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [31]:
data.drop_duplicates(subset=["k1","k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [32]:
data.drop_duplicates(subset=["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [33]:
data=pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],"ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal={
    "bacon":"pig",
    "pulled pork":"pig",
    "pastrami":"cow",
    "corned beef":"cow",
    "honey ham":"pig",
    "nova lox":"salmon"
}

In [35]:
data["animal"]=data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
def get_animal(x):
    return meat_to_animal[x]

In [37]:
get_animal("bacon")

'pig'

In [38]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [39]:
data=pd.Series([1,-999,2,-999,-1000,3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [40]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [46]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=["Ohio","Colorado","New York"],columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
def transform(x):
    return x[:4].upper()

In [49]:
transform("motion")

'MOTI'

In [51]:
list1=["motion","animation","cartoon"]

In [53]:
list(map(transform,list1))

['MOTI', 'ANIM', 'CART']

In [54]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [55]:
data.index=data.index.map(transform)

In [56]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [58]:
data.rename(index=str.title,columns=str.upper)
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
data.rename(index={"OHIO":"INDIANA"},columns={"three":"pekaboo"})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

## Discretization and Binning

In [60]:
ages=[20,22,25,27,21,23,37,31,65,45,41,32]

In [63]:
bins=[18,25,35,60,100]
ages_categories=pd.cut(ages,bins)
ages_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
ages_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [65]:
ages_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [66]:
ages_categories.categories[0]

Interval(18, 25, closed='right')

In [67]:
pd.value_counts(ages_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [68]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [69]:
group_names=["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [74]:
data=np.random.uniform(size=20)
data

array([0.14566675, 0.56737349, 0.6332491 , 0.20690084, 0.03289466,
       0.35632437, 0.79070319, 0.405308  , 0.98755959, 0.87348242,
       0.600365  , 0.44763853, 0.43619973, 0.62226893, 0.94016596,
       0.96771113, 0.03196206, 0.15274813, 0.47519397, 0.92053503])

In [75]:
pd.cut(data,4,precision=2)

[(0.031, 0.27], (0.51, 0.75], (0.51, 0.75], (0.031, 0.27], (0.031, 0.27], ..., (0.75, 0.99], (0.031, 0.27], (0.031, 0.27], (0.27, 0.51], (0.75, 0.99]]
Length: 20
Categories (4, interval[float64, right]): [(0.031, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [76]:
number_categories=pd.cut(data,4,precision=2)
pd.value_counts(number_categories)

(0.75, 0.99]     6
(0.031, 0.27]    5
(0.27, 0.51]     5
(0.51, 0.75]     4
dtype: int64

In [77]:
min(data)

0.03196206315320116

In [78]:
max(data)

0.9875595858927255

In [81]:
 bin_width=(max(data)-min(data))/4#
 bin_width

0.2388993806848811

In [80]:
0.75+(max(data)-min(data))/4

0.9888993806848811

In [82]:
0.031+bin_width

0.26989938068488106

In [83]:
0.27+bin_width

0.5088993806848812

In [84]:
data=np.random.standard_normal(1000)
quartiles=pd.qcut(data,4,precision=2)
quartiles

[(-3.1799999999999997, -0.64], (0.67, 3.62], (-3.1799999999999997, -0.64], (-0.0058, 0.67], (-0.64, -0.0058], ..., (-0.64, -0.0058], (-3.1799999999999997, -0.64], (-0.0058, 0.67], (0.67, 3.62], (-0.64, -0.0058]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1799999999999997, -0.64] < (-0.64, -0.0058] < (-0.0058, 0.67] < (0.67, 3.62]]

In [85]:
pd.value_counts(quartiles)

(-3.1799999999999997, -0.64]    250
(-0.64, -0.0058]                250
(-0.0058, 0.67]                 250
(0.67, 3.62]                    250
dtype: int64

In [87]:
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-3.169, -1.282]      100
(-1.282, -0.00578]    400
(-0.00578, 1.286]     400
(1.286, 3.62]         100
dtype: int64

## Detecting and Filtering Outliers